# ContFootingRadiusTooSmall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..ContFootingRadiusTooSmall Property
BuiltInFailures..::..WallFailures Class See Also
---
Can't display the Wall Foundation, because the Wall's radius is too small. Please increase the radius to display the Wall Foundation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContFootingRadiusTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContFootingRadiusTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContFootingRadiusTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace